#+SETUPFILE: "../etc/org_mode_SETUPFILE.org"
#+INCLUDE: "../etc/org_mode_COMMON_SETUP_FILE.org"
#+INCLUDE: "../etc/org_mode_SETUPFILE_4Beamer.org"

#+TITLE:Maven
#+SUBTITLE: Anotacoes e Notas de Aulas

** confirmando pra ver se as dependencias foram copias
   #+BEGIN_SRC sh :exports both
   ls projetomaven/target/libs
   #+END_SRC

   #+RESULTS:
   : mssql-jdbc-6.1.0.jre7.jar

** rodando o jar com dependencias
#+NAME: rodando jar com deps
#+BEGIN_SRC sh :results output :exports both
 java -jar projetomaven/target/projetomaven-1.0-SNAPSHOT.jar 
#+END_SRC

#+RESULTS: rodando jar com deps
: Hello World!
: ConnectionID:1 ClientConnectionId: d0eb0655-74f4-45cd-ad61-eb03b3b9da3c

